---
kind: method
id: M:Autodesk.Revit.DB.View3D.Unlock
zh: 三维视图、3d视图
source: html/8c0bec29-1f19-c35a-5210-1db2b1d7ed7d.htm
---
# Autodesk.Revit.DB.View3D.Unlock Method

**中文**: 三维视图、3d视图

Unlocks the view. Has no effect if the view is already unlocked.

## Syntax (C#)
```csharp
public void Unlock()
```